# PropertyAreaUnits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PropertyAreaUnits Property
ParameterTypeId Class See Also
---
"Area Units, Format"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PropertyAreaUnits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertyAreaUnits As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PropertyAreaUnits {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace